ksd_file/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Body><transferKSDPositions xmlns="http://www.bmw.com/SRP" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" refSchema="serviceRepairPackages.xsd" version="01.00.05"><vin vinLongPrefix="WBAFW12020" vinShort="C840790"/><position><flatRate productType="car"><number>0099000</number><designation>REPLACING EXHAUST FLEXIBLE</designation><value>25</value></flatRate></position></transferKSDPositions></SOAP-ENV:Body></SOAP-ENV:Envelope>